In [4]:
import pandas as pd
import numpy as np

In [2]:
mi_dic = {'Nombre': ['Juan', ' Pablo', 'José'], 'Peso': [70,90,87], 'Altura': [170, 184, 190]}

In [3]:
mi_dic

{'Nombre': ['Juan', ' Pablo', 'José'],
 'Peso': [70, 90, 87],
 'Altura': [170, 184, 190]}

In [8]:
df1 = pd.DataFrame(mi_dic, index= mi_dic['Nombre']).drop('Nombre', axis = 1) # index_col = 'Nombre'

In [9]:
df1

        Peso  Altura
Juan      70     170
 Pablo    90     184
José      87     190

In [10]:
np.sqrt(df1)

            Peso     Altura
Juan    8.366600  13.038405
 Pablo  9.486833  13.564660
José    9.327379  13.784049

In [15]:
for i in df1.columns:
    df1[i] = [j**2 for j in df1[i]]

In [25]:
for j in df1[i]:
    print(j)

28900
33856
36100

In [16]:
df1.columns

Index(['Peso', 'Altura'], dtype='object')

In [17]:
df1.Peso

Juan      4900
 Pablo    8100
José      7569
Name: Peso, dtype: int64

In [23]:
#en matemática
# {2 * [4 + (10**2 - 300) * 12]}
(2 * (4 + (10**2 - 300)*12))

TypeError: unhashable type: 'list'

In [24]:
# como saber donde estoy trabajando
import os
os.getcwd()

'c:\\Users\\Pablo\\Documents\\GitProjects\\Henry\\DS-M1'